Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/sd24_b.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2014, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//*****************************************************************************
//
// sd24_b.c - Driver for the sd24_b Module.
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup sd24_b_api
//! @{
//
//*****************************************************************************

#include "inc/hw_regaccess.h"
#include "inc/hw_memmap.h"

#ifdef __MSP430_HAS_SD24_B__
#include "sd24_b.h"

#include <assert.h>

//*****************************************************************************
//
//! \brief DEPRECATED - Initializes the SD24_B Module
//!
//! This function initializes the SD24_B module sigma-delta analog-to-digital
//! conversions. Specifically the function sets up the clock source for the
//! SD24_B core to use for conversions. Upon completion of the initialization
//! the SD24_B interrupt registers will be reset and the given parameters will
//! be set. The converter configuration settings are independent of this
//! function. The values you choose for the clock divider and predivider are
//! used to determine the effective clock frequency. The formula used is:
//! f_sd24 = f_clk /(divider * predivider)
//!
//! \param baseAddress is the base address of the SD24_B module.
//! \param clockSourceSelect selects the clock that will be used as the SD24_B
//!        core
//!        Valid values are:
//!        - \b SD24_B_CLOCKSOURCE_MCLK [Default]
//!        - \b SD24_B_CLOCKSOURCE_SMCLK
//!        - \b SD24_B_CLOCKSOURCE_ACLK
//!        - \b SD24_B_CLOCKSOURCE_SD24CLK
//!        \n Modified bits are \b SD24SSEL of \b SD24BCTL0 register.
//! \param clockPreDivider selects the amount that the clock will be predivided
//!        Valid values are:
//!        - \b SD24_B_PRECLOCKDIVIDER_1 [Default]
//!        - \b SD24_B_PRECLOCKDIVIDER_2
//!        - \b SD24_B_PRECLOCKDIVIDER_4
//!        - \b SD24_B_PRECLOCKDIVIDER_8
//!        - \b SD24_B_PRECLOCKDIVIDER_16
//!        - \b SD24_B_PRECLOCKDIVIDER_32
//!        - \b SD24_B_PRECLOCKDIVIDER_64
//!        - \b SD24_B_PRECLOCKDIVIDER_128
//!        \n Modified bits are \b SD24PDIVx of \b SD24BCTL0 register.
//! \param clockDivider selects the amount that the clock will be divided.
//!        Valid values are:
//!        - \b SD24_B_CLOCKDIVIDER_1 [Default]
//!        - \b SD24_B_CLOCKDIVIDER_2
//!        - \b SD24_B_CLOCKDIVIDER_3
//!        - \b SD24_B_CLOCKDIVIDER_4
//!        - \b SD24_B_CLOCKDIVIDER_5
//!        - \b SD24_B_CLOCKDIVIDER_6
//!        - \b SD24_B_CLOCKDIVIDER_7
//!        - \b SD24_B_CLOCKDIVIDER_8
//!        - \b SD24_B_CLOCKDIVIDER_9
//!        - \b SD24_B_CLOCKDIVIDER_10
//!        - \b SD24_B_CLOCKDIVIDER_11
//!        - \b SD24_B_CLOCKDIVIDER_12
//!        - \b SD24_B_CLOCKDIVIDER_13
//!        - \b SD24_B_CLOCKDIVIDER_14
//!        - \b SD24_B_CLOCKDIVIDER_15
//!        - \b SD24_B_CLOCKDIVIDER_16
//!        - \b SD24_B_CLOCKDIVIDER_17
//!        - \b SD24_B_CLOCKDIVIDER_18
//!        - \b SD24_B_CLOCKDIVIDER_19
//!        - \b SD24_B_CLOCKDIVIDER_20
//!        - \b SD24_B_CLOCKDIVIDER_21
//!        - \b SD24_B_CLOCKDIVIDER_22
//!        - \b SD24_B_CLOCKDIVIDER_23
//!        - \b SD24_B_CLOCKDIVIDER_24
//!        - \b SD24_B_CLOCKDIVIDER_25
//!        - \b SD24_B_CLOCKDIVIDER_26
//!        - \b SD24_B_CLOCKDIVIDER_27
//!        - \b SD24_B_CLOCKDIVIDER_28
//!        - \b SD24_B_CLOCKDIVIDER_29
//!        - \b SD24_B_CLOCKDIVIDER_30
//!        - \b SD24_B_CLOCKDIVIDER_31
//!        - \b SD24_B_CLOCKDIVIDER_32
//!        \n Modified bits are \b SD24DIVx of \b SD24BCTL0 register.
//! \param referenceSelect selects the reference source for the SD24_B core
//!        Valid values are:
//!        - \b SD24_B_REF_EXTERNAL [Default]
//!        - \b SD24_B_REF_INTERNAL
//!        \n Modified bits are \b SD24REFS of \b SD24BCTL0 register.
//!
//! \return None
//
//*****************************************************************************
void SD24_B_init(uint16_t baseAddress,
                 uint16_t clockSourceSelect,
                 uint16_t clockPreDivider,
                 uint16_t clockDivider,
                 uint16_t referenceSelect )
{
        SD24_B_initializeParam param = { 0 };

        param.clockSourceSelect = clockSourceSelect;
        param.clockPreDivider = clockPreDivider;
        param.clockDivider = clockDivider;
        param.referenceSelect = referenceSelect;

