Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/sd24_b.c
        SD24_B_initialize(baseAddress, &param);
}

//*****************************************************************************
//
//! \brief Initializes the SD24_B Module
//!
//! This function initializes the SD24_B module sigma-delta analog-to-digital
//! conversions. Specifically the function sets up the clock source for the
//! SD24_B core to use for conversions. Upon completion of the initialization
//! the SD24_B interrupt registers will be reset and the given parameters will
//! be set. The converter configuration settings are independent of this
//! function. The values you choose for the clock divider and predivider are
//! used to determine the effective clock frequency. The formula used is:
//! f_sd24 = f_clk /(divider * predivider)
//!
//! \param baseAddress is the base address of the SD24_B module.
//! \param param is the pointer to struct for initialization.
//!
//! \return None
//
//*****************************************************************************
void SD24_B_initialize(uint16_t baseAddress, SD24_B_initializeParam *param)
{
        assert(param != 0);
        assert(
                (SD24_B_CLOCKSOURCE_MCLK == param->clockSourceSelect) ||
                (SD24_B_CLOCKSOURCE_SMCLK == param->clockSourceSelect) ||
                (SD24_B_CLOCKSOURCE_ACLK == param->clockSourceSelect) ||
                (SD24_B_CLOCKSOURCE_SD24CLK == param->clockSourceSelect)
                );

        assert(
                (SD24_B_REF_EXTERNAL == param->referenceSelect) ||
                (SD24_B_REF_INTERNAL == param->referenceSelect)
                );

        // Reset all interrupts and flags
        HWREG16(baseAddress + OFS_SD24BIE)   &= 0x0000; //Reset ALL interrupt enables
        HWREG16(baseAddress + OFS_SD24BIFG)  &= 0x0000; //Reset ALL interrupt flags
        HWREG16(baseAddress + OFS_SD24BTRGCTL) &= ~(SD24TRGIE | SD24TRGIFG);

        // Turn off all group conversions
        HWREG16(baseAddress + OFS_SD24BCTL1) &= ~(SD24GRP0SC | SD24GRP1SC
                                                  | SD24GRP2SC | SD24GRP3SC);

        // Configure SD24_B
        HWREG16(baseAddress + OFS_SD24BCTL0) &= ~((SD24DIV4 | SD24DIV3 | SD24DIV2
                                                   | SD24DIV1 | SD24DIV0) | SD24PDIV_7 | SD24SSEL_3 | SD24REFS);
        HWREG16(baseAddress + OFS_SD24BCTL0) |= (param->clockSourceSelect |
                                                 param->clockPreDivider | param->clockDivider | param->referenceSelect);

        return;
}

//*****************************************************************************
//
//! \brief DEPRECATED - Configure SD24_B converter
//!
//! This function initializes a converter of the SD24_B module. Upon completion
//! the converter will be ready for a conversion and can be started with the
//! SD24_B_startGroupConversion() or SD24_B_startConverterConversion()
//! depending on the startSelect parameter. Additional configuration such as
//! data format can be configured in SD24_B_setConverterDataFormat().
//!
//! \param baseAddress is the base address of the SD24_B module.
//! \param converter selects the converter that will be configured. Check check
//!        datasheet for available converters on device.
//!        Valid values are:
//!        - \b SD24_B_CONVERTER_0
//!        - \b SD24_B_CONVERTER_1
//!        - \b SD24_B_CONVERTER_2
//!        - \b SD24_B_CONVERTER_3
//!        - \b SD24_B_CONVERTER_4
//!        - \b SD24_B_CONVERTER_5
//!        - \b SD24_B_CONVERTER_6
//!        - \b SD24_B_CONVERTER_7
//! \param alignment selects how the data will be aligned in result
//!        Valid values are:
//!        - \b SD24_B_ALIGN_RIGHT [Default]
//!        - \b SD24_B_ALIGN_LEFT
//!        \n Modified bits are \b SD24ALGN of \b SD24BCCTLx register.
//! \param startSelect selects what will trigger the start of the converter
//!        Valid values are:
//!        - \b SD24_B_CONVERSION_SELECT_SD24SC [Default]
//!        - \b SD24_B_CONVERSION_SELECT_EXT1
//!        - \b SD24_B_CONVERSION_SELECT_EXT2
//!        - \b SD24_B_CONVERSION_SELECT_EXT3
//!        - \b SD24_B_CONVERSION_SELECT_GROUP0
//!        - \b SD24_B_CONVERSION_SELECT_GROUP1
//!        - \b SD24_B_CONVERSION_SELECT_GROUP2
//!        - \b SD24_B_CONVERSION_SELECT_GROUP3
//!        \n Modified bits are \b SD24SCSx of \b SD24BCCTLx register.
//! \param conversionMode determines whether the converter will do continuous
//!        samples or a single sample
//!        Valid values are:
//!        - \b SD24_B_CONTINUOUS_MODE [Default]
//!        - \b SD24_B_SINGLE_MODE
//!        \n Modified bits are \b SD24SNGL of \b SD24BCCTLx register.
//!
//! \return None
//
//*****************************************************************************
void SD24_B_configureConverter(uint16_t baseAddress,
                               uint8_t converter,
                               uint8_t alignment,
                               uint8_t startSelect,
                               uint8_t conversionMode )
{
        SD24_B_initConverterParam param = { 0 };

        param.converter = converter;
        param.alignment = alignment;
        param.startSelect = startSelect;
        param.conversionMode = conversionMode;

        SD24_B_initConverter(baseAddress, &param);
}

//*****************************************************************************
//
//! \brief Configure SD24_B converter
//!
//! This function initializes a converter of the SD24_B module. Upon completion
//! the converter will be ready for a conversion and can be started with the
//! SD24_B_startGroupConversion() or SD24_B_startConverterConversion()
//! depending on the startSelect parameter. Additional configuration such as
//! data format can be configured in SD24_B_setConverterDataFormat().
//!
//! \param baseAddress is the base address of the SD24_B module.
//! \param param is the pointer to struct for converter configuration.
//!
//! \return None
//
//*****************************************************************************
void SD24_B_initConverter(uint16_t baseAddress,
                          SD24_B_initConverterParam *param)
{
        assert(param != 0);
        assert(
                (SD24_B_CONVERTER_0 == param->converter) ||
                (SD24_B_CONVERTER_1 == param->converter) ||
                (SD24_B_CONVERTER_2 == param->converter) ||
                (SD24_B_CONVERTER_3 == param->converter) ||
                (SD24_B_CONVERTER_4 == param->converter) ||
                (SD24_B_CONVERTER_5 == param->converter) ||
                (SD24_B_CONVERTER_6 == param->converter) ||
                (SD24_B_CONVERTER_7 == param->converter)
                );

