Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/sd24_b.c
        uint16_t address = baseAddress + (OFS_SD24BCCTL0 + (param->converter * 0x08));

        // Clearing previous settings for configuration
        HWREG16(address) &= ~(SD24ALGN | SD24SNGL | SD24SCS__GROUP3);

        HWREG16(address) |= (param->alignment | param->startSelect |
                             (((uint16_t)param->conversionMode) << 8));
}

//*****************************************************************************
//
//! \brief DEPRECATED - Configure SD24_B converter - Advanced Configure
//!
//! This function initializes a converter of the SD24_B module. Upon completion
//! the converter will be ready for a conversion and can be started with the
//! SD24_B_startGroupConversion() or SD24_B_startConverterConversion()
//! depending on the startSelect parameter.
//!
//! \param baseAddress is the base address of the SD24_B module.
//! \param converter selects the converter that will be configured. Check check
//!        datasheet for available converters on device.
//!        Valid values are:
//!        - \b SD24_B_CONVERTER_0
//!        - \b SD24_B_CONVERTER_1
//!        - \b SD24_B_CONVERTER_2
//!        - \b SD24_B_CONVERTER_3
//!        - \b SD24_B_CONVERTER_4
//!        - \b SD24_B_CONVERTER_5
//!        - \b SD24_B_CONVERTER_6
//!        - \b SD24_B_CONVERTER_7
//! \param alignment selects how the data will be aligned in result
//!        Valid values are:
//!        - \b SD24_B_ALIGN_RIGHT [Default]
//!        - \b SD24_B_ALIGN_LEFT
//!        \n Modified bits are \b SD24ALGN of \b SD24BCCTLx register.
//! \param startSelect selects what will trigger the start of the converter
//!        Valid values are:
//!        - \b SD24_B_CONVERSION_SELECT_SD24SC [Default]
//!        - \b SD24_B_CONVERSION_SELECT_EXT1
//!        - \b SD24_B_CONVERSION_SELECT_EXT2
//!        - \b SD24_B_CONVERSION_SELECT_EXT3
//!        - \b SD24_B_CONVERSION_SELECT_GROUP0
//!        - \b SD24_B_CONVERSION_SELECT_GROUP1
//!        - \b SD24_B_CONVERSION_SELECT_GROUP2
//!        - \b SD24_B_CONVERSION_SELECT_GROUP3
//!        \n Modified bits are \b SD24SCSx of \b SD24BCCTLx register.
//! \param conversionMode determines whether the converter will do continuous
//!        samples or a single sample
//!        Valid values are:
//!        - \b SD24_B_CONTINUOUS_MODE [Default]
//!        - \b SD24_B_SINGLE_MODE
//!        \n Modified bits are \b SD24SNGL of \b SD24BCCTLx register.
//! \param dataFormat selects how the data format of the results
//!        Valid values are:
//!        - \b SD24_B_DATA_FORMAT_BINARY [Default]
//!        - \b SD24_B_DATA_FORMAT_2COMPLEMENT
//!        \n Modified bits are \b SD24DFx of \b SD24BCCTLx register.
//! \param sampleDelay selects the delay for the interrupt
//!        Valid values are:
//!        - \b SD24_B_FOURTH_SAMPLE_INTERRUPT [Default]
//!        - \b SD24_B_THIRD_SAMPLE_INTERRUPT
//!        - \b SD24_B_SECOND_SAMPLE_INTERRUPT
//!        - \b SD24_B_FIRST_SAMPLE_INTERRUPT
//!        \n Modified bits are \b SD24INTDLYx of \b SD24INCTLx register.
//! \param oversampleRatio selects oversampling ratio for the converter
//!        Valid values are:
//!        - \b SD24_B_OVERSAMPLE_32
//!        - \b SD24_B_OVERSAMPLE_64
//!        - \b SD24_B_OVERSAMPLE_128
//!        - \b SD24_B_OVERSAMPLE_256
//!        - \b SD24_B_OVERSAMPLE_512
//!        - \b SD24_B_OVERSAMPLE_1024
//!        \n Modified bits are \b SD24OSRx of \b SD24BOSRx register.
//! \param gain selects the gain for the converter
//!        Valid values are:
//!        - \b SD24_B_GAIN_1 [Default]
//!        - \b SD24_B_GAIN_2
//!        - \b SD24_B_GAIN_4
//!        - \b SD24_B_GAIN_8
//!        - \b SD24_B_GAIN_16
//!        - \b SD24_B_GAIN_32
//!        - \b SD24_B_GAIN_64
//!        - \b SD24_B_GAIN_128
//!        \n Modified bits are \b SD24GAINx of \b SD24BINCTLx register.
//!
//! \return None
//
//*****************************************************************************
void SD24_B_configureConverterAdvanced(uint16_t baseAddress,
                                       uint8_t converter,
                                       uint8_t alignment,
                                       uint8_t startSelect,
                                       uint8_t conversionMode,
                                       uint8_t dataFormat,
                                       uint8_t sampleDelay,
                                       uint16_t oversampleRatio,
                                       uint8_t gain
                                       )
{
        SD24_B_initConverterAdvancedParam param = { 0 };

        param.converter = converter;
        param.alignment = alignment;
        param.startSelect = startSelect;
        param.conversionMode = conversionMode;
        param.dataFormat = dataFormat;
        param.sampleDelay = sampleDelay;
        param.oversampleRatio = oversampleRatio;
        param.gain = gain;

        SD24_B_initConverterAdvanced(baseAddress, &param);
}

//*****************************************************************************
//
//! \brief Configure SD24_B converter - Advanced Configure
//!
//! This function initializes a converter of the SD24_B module. Upon completion
//! the converter will be ready for a conversion and can be started with the
//! SD24_B_startGroupConversion() or SD24_B_startConverterConversion()
//! depending on the startSelect parameter.
//!
//! \param baseAddress is the base address of the SD24_B module.
//! \param param is the pointer to struct for converter advanced configuration.
//!
//! \return None
//
//*****************************************************************************
void SD24_B_initConverterAdvanced(uint16_t baseAddress,
                                  SD24_B_initConverterAdvancedParam *param)
{
        assert(param != 0);
        assert(
                (SD24_B_CONVERTER_0 == param->converter) ||
                (SD24_B_CONVERTER_1 == param->converter) ||
                (SD24_B_CONVERTER_2 == param->converter) ||
                (SD24_B_CONVERTER_3 == param->converter) ||
                (SD24_B_CONVERTER_4 == param->converter) ||
                (SD24_B_CONVERTER_5 == param->converter) ||
                (SD24_B_CONVERTER_6 == param->converter) ||
                (SD24_B_CONVERTER_7 == param->converter)
                );

        // Getting correct SD24BCCTLx register
        uint16_t address = baseAddress + (OFS_SD24BCCTL0 + (param->converter * 0x08));

        // Clearing previous settings for configuration
        HWREG16(address) &= ~(SD24ALGN | SD24SNGL | SD24DF_1 | SD24DF_0 | SD24SCS__GROUP3 );

        HWREG16(address) |= (param->alignment | param->startSelect | param->dataFormat |
                             (((uint16_t)param->conversionMode) << 8));

