Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/sd24_b.c
        // Getting correct SDBINTCTLx register
        address = baseAddress + (OFS_SD24BINCTL0 + (param->converter * 0x08));

        // Clearing previous settings for configuration
        HWREG16(address) &= ~(SD24GAIN_128 | SD24INTDLY_3);

        HWREG16(address) |= (param->gain | param->sampleDelay);

        // Getting correct SDBOSRx register
        address = baseAddress + (OFS_SD24BOSR0 + (param->converter * 0x08));

        // Clearing previous settings for configuration
        HWREG16(address) &= ~(OSR10 | OSR9 | OSR8 | OSR7 | OSR6 | OSR5 | OSR4 |
                              OSR3 | OSR2 | OSR1 | OSR0);

        HWREG16(address) |= param->oversampleRatio;
}
//*****************************************************************************
//
//! \brief Set SD24_B converter data format
//!
//! This function sets the converter format so that the resulting data can be
//! viewed in either binary or 2's complement.
//!
//! \param baseAddress is the base address of the SD24_B module.
//! \param converter selects the converter that will be configured. Check check
//!        datasheet for available converters on device.
//!        Valid values are:
//!        - \b SD24_B_CONVERTER_0
//!        - \b SD24_B_CONVERTER_1
//!        - \b SD24_B_CONVERTER_2
//!        - \b SD24_B_CONVERTER_3
//!        - \b SD24_B_CONVERTER_4
//!        - \b SD24_B_CONVERTER_5
//!        - \b SD24_B_CONVERTER_6
//!        - \b SD24_B_CONVERTER_7
//! \param dataFormat selects how the data format of the results
//!        Valid values are:
//!        - \b SD24_B_DATA_FORMAT_BINARY [Default]
//!        - \b SD24_B_DATA_FORMAT_2COMPLEMENT
//!        \n Modified bits are \b SD24DFx of \b SD24BCCTLx register.
//!
//! \return None
//
//*****************************************************************************
void SD24_B_setConverterDataFormat(uint16_t baseAddress,
                                   uint8_t converter,
                                   uint8_t dataFormat)
{

        uint16_t address = baseAddress + (OFS_SD24BCCTL0_L +
                                          (converter * 0x08));

        assert(
                (SD24_B_CONVERTER_0 == converter) ||
                (SD24_B_CONVERTER_1 == converter) ||
                (SD24_B_CONVERTER_2 == converter) ||
                (SD24_B_CONVERTER_3 == converter) ||
                (SD24_B_CONVERTER_4 == converter) ||
                (SD24_B_CONVERTER_5 == converter) ||
                (SD24_B_CONVERTER_6 == converter) ||
                (SD24_B_CONVERTER_7 == converter)
                );

        // Clearing previous settings for configuration
        HWREG8(address) &= ~(SD24DF0 | SD24DF1);

        HWREG8(address) |= dataFormat;
}

//*****************************************************************************
//
//! \brief Start Conversion Group
//!
//! This function starts all the converters that are associated with a group.
//! To set a converter to a group use the SD24_B_configureConverter() function.
//!
//! \param baseAddress is the base address of the SD24_B module.
//! \param group selects the group that will be started
//!        Valid values are:
//!        - \b SD24_B_GROUP0
//!        - \b SD24_B_GROUP1
//!        - \b SD24_B_GROUP2
//!        - \b SD24_B_GROUP3
//!        \n Modified bits are \b SD24DGRPxSC of \b SD24BCTL1 register.
//!
//! \return None
//
//*****************************************************************************
void SD24_B_startGroupConversion(uint16_t baseAddress,
                                 uint8_t group)
{
        switch (group) {
        case SD24_B_GROUP0:
                HWREG16(baseAddress + OFS_SD24BCTL1) |= SD24GRP0SC; break;
        case SD24_B_GROUP1:
                HWREG16(baseAddress + OFS_SD24BCTL1) |= SD24GRP1SC; break;
        case SD24_B_GROUP2:
                HWREG16(baseAddress + OFS_SD24BCTL1) |= SD24GRP2SC; break;
        case SD24_B_GROUP3:
                HWREG16(baseAddress + OFS_SD24BCTL1) |= SD24GRP3SC; break;
        }
}

//*****************************************************************************
//
//! \brief Stop Conversion Group
//!
//! This function stops all the converters that are associated with a group. To
//! set a converter to a group use the SD24_B_configureConverter() function.
//!
//! \param baseAddress is the base address of the SD24_B module.
//! \param group selects the group that will be stopped
//!        Valid values are:
//!        - \b SD24_B_GROUP0
//!        - \b SD24_B_GROUP1
//!        - \b SD24_B_GROUP2
//!        - \b SD24_B_GROUP3
//!        \n Modified bits are \b SD24DGRPxSC of \b SD24BCTL1 register.
//!
//! \return None
//
//*****************************************************************************
void SD24_B_stopGroupConversion(uint16_t baseAddress,
                                uint8_t group)
{
        switch (group) {
        case SD24_B_GROUP0:
                HWREG16(baseAddress + OFS_SD24BCTL1) &= ~(SD24GRP0SC); break;
        case SD24_B_GROUP1:
                HWREG16(baseAddress + OFS_SD24BCTL1) &= ~(SD24GRP1SC); break;
        case SD24_B_GROUP2:
                HWREG16(baseAddress + OFS_SD24BCTL1) &= ~(SD24GRP2SC); break;
        case SD24_B_GROUP3:
                HWREG16(baseAddress + OFS_SD24BCTL1) &= ~(SD24GRP3SC); break;
        }
}

//*****************************************************************************
//
//! \brief Start Conversion for Converter
//!
//! This function starts a single converter.
//!
//! \param baseAddress is the base address of the SD24_B module.
//! \param converter selects the converter that will be started
//!        Valid values are:
//!        - \b SD24_B_CONVERTER_0
//!        - \b SD24_B_CONVERTER_1
//!        - \b SD24_B_CONVERTER_2
//!        - \b SD24_B_CONVERTER_3
//!        - \b SD24_B_CONVERTER_4
//!        - \b SD24_B_CONVERTER_5
//!        - \b SD24_B_CONVERTER_6
//!        - \b SD24_B_CONVERTER_7
//!        \n Modified bits are \b SD24SC of \b SD24BCCTLx register.
//!
//! \return None
//
//*****************************************************************************
void SD24_B_startConverterConversion(uint16_t baseAddress,
                                     uint8_t converter)
{
        uint16_t address = baseAddress + (OFS_SD24BCCTL0 + (converter * 0x08));

