Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/sd24_b.c
        assert(
                (SD24_B_CONVERTER_0 == converter) ||
                (SD24_B_CONVERTER_1 == converter) ||
                (SD24_B_CONVERTER_2 == converter) ||
                (SD24_B_CONVERTER_3 == converter) ||
                (SD24_B_CONVERTER_4 == converter) ||
                (SD24_B_CONVERTER_5 == converter) ||
                (SD24_B_CONVERTER_6 == converter) ||
                (SD24_B_CONVERTER_7 == converter)
                );
        // Clearing trigger generation select
        HWREG16(address) &= ~(SD24SCS_7);

        // Setting SD24SC bit to start conversion
        HWREG16(address) |= SD24SC;
}

//*****************************************************************************
//
//! \brief Stop Conversion for Converter
//!
//! This function stops a single converter.
//!
//! \param baseAddress is the base address of the SD24_B module.
//! \param converter selects the converter that will be stopped
//!        Valid values are:
//!        - \b SD24_B_CONVERTER_0
//!        - \b SD24_B_CONVERTER_1
//!        - \b SD24_B_CONVERTER_2
//!        - \b SD24_B_CONVERTER_3
//!        - \b SD24_B_CONVERTER_4
//!        - \b SD24_B_CONVERTER_5
//!        - \b SD24_B_CONVERTER_6
//!        - \b SD24_B_CONVERTER_7
//!        \n Modified bits are \b SD24SC of \b SD24BCCTLx register.
//!
//! \return None
//
//*****************************************************************************
void SD24_B_stopConverterConversion(uint16_t baseAddress,
                                    uint8_t converter)
{
        assert(
                (SD24_B_CONVERTER_0 == converter) ||
                (SD24_B_CONVERTER_1 == converter) ||
                (SD24_B_CONVERTER_2 == converter) ||
                (SD24_B_CONVERTER_3 == converter) ||
                (SD24_B_CONVERTER_4 == converter) ||
                (SD24_B_CONVERTER_5 == converter) ||
                (SD24_B_CONVERTER_6 == converter) ||
                (SD24_B_CONVERTER_7 == converter)
                );

        uint16_t address = baseAddress + (OFS_SD24BCCTL0 + (converter * 0x08));

        // Clearing trigger generation select
        HWREG16(address) &= ~(SD24SCS_7);

        // Setting SD24SC bit to start conversion
        HWREG16(address) &= ~(SD24SC);
}

//*****************************************************************************
//
//! \brief Configures the converter that triggers a DMA transfer
//!
//! This function chooses which interrupt will trigger a DMA transfer.
//!
//! \param baseAddress is the base address of the SD24_B module.
//! \param interruptFlag selects the converter interrupt that triggers a DMA
//!        transfer.
//!        Valid values are:
//!        - \b SD24_B_DMA_TRIGGER_IFG0
//!        - \b SD24_B_DMA_TRIGGER_IFG1
//!        - \b SD24_B_DMA_TRIGGER_IFG2
//!        - \b SD24_B_DMA_TRIGGER_IFG3
//!        - \b SD24_B_DMA_TRIGGER_IFG4
//!        - \b SD24_B_DMA_TRIGGER_IFG5
//!        - \b SD24_B_DMA_TRIGGER_IFG6
//!        - \b SD24_B_DMA_TRIGGER_IFG7
//!        - \b SD24_B_DMA_TRIGGER_TRGIFG
//!        \n Modified bits are \b SD24DMAx of \b SD24BCTL1 register.
//!
//! \return None
//
//*****************************************************************************
void SD24_B_configureDMATrigger(uint16_t baseAddress,
                                uint16_t interruptFlag)
{
        // Clearing previous settings
        HWREG16(baseAddress + OFS_SD24BCTL1) &= ~(SD24DMA_3 | SD24DMA_2 |
                                                  SD24DMA_1 | SD24DMA_0);

        HWREG16(baseAddress + OFS_SD24BCTL1) |= interruptFlag;
}

//*****************************************************************************
//
//! \brief Configures the delay for an interrupt to trigger
//!
//! This function configures the delay for the first interrupt service request
//! for the corresponding converter. This feature delays the interrupt request
//! for a completed conversion by up to four conversion cycles allowing the
//! digital filter to settle prior to generating an interrupt request.
//!
//! \param baseAddress is the base address of the SD24_B module.
//! \param converter selects the converter that will be stopped
//!        Valid values are:
//!        - \b SD24_B_CONVERTER_0
//!        - \b SD24_B_CONVERTER_1
//!        - \b SD24_B_CONVERTER_2
//!        - \b SD24_B_CONVERTER_3
//!        - \b SD24_B_CONVERTER_4
//!        - \b SD24_B_CONVERTER_5
//!        - \b SD24_B_CONVERTER_6
//!        - \b SD24_B_CONVERTER_7
//! \param sampleDelay selects the delay for the interrupt
//!        Valid values are:
//!        - \b SD24_B_FOURTH_SAMPLE_INTERRUPT [Default]
//!        - \b SD24_B_THIRD_SAMPLE_INTERRUPT
//!        - \b SD24_B_SECOND_SAMPLE_INTERRUPT
//!        - \b SD24_B_FIRST_SAMPLE_INTERRUPT
//!        \n Modified bits are \b SD24INTDLYx of \b SD24INCTLx register.
//!
//! \return None
//
//*****************************************************************************
void SD24_B_setInterruptDelay(uint16_t baseAddress,
                              uint8_t converter,
                              uint8_t sampleDelay)
{
        assert(
                (SD24_B_CONVERTER_0 == converter) ||
                (SD24_B_CONVERTER_1 == converter) ||
                (SD24_B_CONVERTER_2 == converter) ||
                (SD24_B_CONVERTER_3 == converter) ||
                (SD24_B_CONVERTER_4 == converter) ||
                (SD24_B_CONVERTER_5 == converter) ||
                (SD24_B_CONVERTER_6 == converter) ||
                (SD24_B_CONVERTER_7 == converter)
                );

        uint16_t address = baseAddress + (OFS_SD24BINCTL0 + (converter * 0x08));

        // Clear previous settings
        HWREG16(address) &= ~(SD24INTDLY_3);

        HWREG16(address) |= sampleDelay;

}

//*****************************************************************************
//
//! \brief Configures the oversampling ratio for a converter
//!
//! This function configures the oversampling ratio for a given converter.
//!
//! \param baseAddress is the base address of the SD24_B module.
//! \param converter selects the converter that will be configured
//!        Valid values are:
//!        - \b SD24_B_CONVERTER_0
//!        - \b SD24_B_CONVERTER_1
//!        - \b SD24_B_CONVERTER_2
//!        - \b SD24_B_CONVERTER_3
//!        - \b SD24_B_CONVERTER_4
//!        - \b SD24_B_CONVERTER_5
//!        - \b SD24_B_CONVERTER_6
//!        - \b SD24_B_CONVERTER_7
//! \param oversampleRatio selects oversampling ratio for the converter
//!        Valid values are:
//!        - \b SD24_B_OVERSAMPLE_32
//!        - \b SD24_B_OVERSAMPLE_64
//!        - \b SD24_B_OVERSAMPLE_128
//!        - \b SD24_B_OVERSAMPLE_256
//!        - \b SD24_B_OVERSAMPLE_512
//!        - \b SD24_B_OVERSAMPLE_1024
//!        \n Modified bits are \b SD24OSRx of \b SD24BOSRx register.
//!
//! \return None
//
//*****************************************************************************
void SD24_B_setOversampling(uint16_t baseAddress,
                            uint8_t converter,
                            uint16_t oversampleRatio)
{
        uint16_t address = baseAddress + (OFS_SD24BOSR0 + (converter * 0x08));

